function SidebarMenuComponent() {

    return (
      <div className="header__left">
      <a className="header__logo" href="#0">
        <img src="./public/markup/images/logo.svg" className="logo" alt="логотип" />
        <img src="./public/markup/images/Академия.svg" className="name_logo" alt="Академия" />
      </a>
      <nav className="menu">
        <ul className="menu__item">
          <li>
            <svg width="20" height="20" viewBox="0 0 20 20"  xmlns="http://www.w3.org/2000/svg">
              <g clip-path="url(#clip0_2449_1292)">
              <rect width="20" height="20" fill="white"/>
              <path d="M16.4402 8.52331V15.5118C16.4402 16.1164 15.9501 16.607 15.3449 16.607H4.65387C4.04925 16.607 3.55859 16.1169 3.55859 15.5118V8.52331C3.55859 8.17753 3.72183 7.85156 3.99951 7.64486L9.34456 3.66263C9.73284 3.37336 10.265 3.37336 10.6528 3.66263L15.9983 7.64486C16.276 7.85156 16.4393 8.17705 16.4393 8.52331H16.4402Z" stroke="#1D1D1B" stroke-width="1.19399" stroke-linejoin="round"/>
              <path d="M9.56415 12.184H10.4349C10.8637 12.184 11.2119 12.5322 11.2119 12.961V16.3154H8.78711V12.961C8.78711 12.5322 9.1353 12.184 9.56415 12.184Z" stroke="#1D1D1B" stroke-width="0.238799" stroke-miterlimit="10"/>
              </g>
              <defs>
              <clipPath id="clip0_2449_1292">
              <rect width="20" height="20" fill="white"/>
              </clipPath>
              </defs>
              </svg>
            <a href="https://academy.uni.rest/home">Главная страница</a>
          </li>
          <li>
            <svg width="20" className="svg" height="20" viewBox="0 0 20 20"  xmlns="http://www.w3.org/2000/svg">
              <path d="M6.27148 9.8473V14.6715H13.7148V9.84729" stroke="#1D1D1B" stroke-width="1.19399" stroke-linejoin="bevel"/>
              <path d="M18.0132 7.93338L9.99295 10.571L1.97266 7.93338L9.99295 5.29541L18.0132 7.93338Z" stroke="#1D1D1B" stroke-width="1.19399" stroke-linejoin="bevel"/>
              <path d="M3.08212 8.75635L3.08642 12.0474L4.36685 14.5284L3.08642 15.1532L1.8418 14.5284L3.08212 12.0473" stroke="#1D1D1B" stroke-width="0.238799" stroke-linejoin="bevel"/>
              <path d="M6.27148 9.74354V14.6715H13.7148V9.74353" stroke="#1D1D1B" stroke-width="1.19399" stroke-linejoin="bevel"/>
              <path d="M3.08212 8.75635L3.08642 12.0474L4.36685 14.5284L3.08642 15.1532L1.8418 14.5284L3.08212 12.0473" stroke="#1D1D1B" stroke-width="0.238799" stroke-linejoin="bevel"/>
              </svg>

            <a href="https://academy.uni.rest/wiki/7125414151896828770"
              >Планы обучения</a
            >
          </li>
          <li>
            <svg className="svg_down" width="19" height="15" viewBox="0 0 19 15" xmlns="http://www.w3.org/2000/svg">
              <path d="M6.62948 9.9375H3.73865C2.51839 9.9375 1.5293 10.9266 1.5293 12.1469C1.5293 13.3671 2.51839 14.3562 3.73865 14.3562H15.7951C15.7951 14.3562 15.4899 12.6894 15.4904 12.1268C15.4909 11.5742 15.7951 9.9375 15.7951 9.9375H10.6785" stroke="#1D1D1B" stroke-width="1.19399" stroke-linejoin="bevel"/>
              <path d="M6.59419 9.93082H3.37305C3.37305 9.93082 3.60133 8.2769 3.60133 7.72145C3.60133 7.16601 3.37305 5.51208 3.37305 5.51208H15.7127C16.933 5.51208 17.9221 6.50119 17.9221 7.72145C17.9221 8.94171 16.933 9.93082 15.7127 9.93082H10.7008" stroke="#1D1D1B" stroke-width="1.19399" stroke-linejoin="bevel"/>
              <path d="M15.6057 5.48917H3.5492C2.32894 5.48917 1.33984 4.50006 1.33984 3.2798C1.33984 2.05954 2.32894 1.07043 3.5492 1.07043H15.6057C15.6057 1.07043 15.3482 2.73247 15.3487 3.29126C15.3487 3.84432 15.6057 5.48917 15.6057 5.48917Z" stroke="#1D1D1B" stroke-width="1.19399" stroke-linejoin="bevel"/>
              <path d="M6.65234 6.05377V11.5051L8.76093 9.94332L10.646 11.5051V6.0509" stroke="#1D1D1B" stroke-width="0.238799" stroke-miterlimit="10"/>
              </svg>

            <a href="https://academy.uni.rest/wiki/7125414151896828770"
              >Библиотека стандартов</a
            >
          </li>
          <li>
            <svg width="21" height="21" viewBox="0 0 21 21"  xmlns="http://www.w3.org/2000/svg">
              <path d="M10.7217 6.39211C11.5485 6.39211 12.2188 5.72184 12.2188 4.89503C12.2188 4.06821 11.5485 3.39795 10.7217 3.39795C9.89487 3.39795 9.22461 4.06821 9.22461 4.89503C9.22461 5.72184 9.89487 6.39211 10.7217 6.39211Z" stroke="#202020" stroke-width="1.19259" stroke-linejoin="bevel"/>
              <path d="M15.3004 6.93493C16.0003 6.93493 16.5676 6.36757 16.5676 5.66772C16.5676 4.96786 16.0003 4.40051 15.3004 4.40051C14.6005 4.40051 14.0332 4.96786 14.0332 5.66772C14.0332 6.36757 14.6005 6.93493 15.3004 6.93493Z" stroke="#1D1D1B" stroke-width="0.238517" stroke-miterlimit="10" stroke-linecap="square"/>
              <path d="M6.14025 6.93493C6.84011 6.93493 7.40745 6.36757 7.40745 5.66772C7.40745 4.96786 6.84011 4.40051 6.14025 4.40051C5.44039 4.40051 4.87305 4.96786 4.87305 5.66772C4.87305 6.36757 5.44039 6.93493 6.14025 6.93493Z" stroke="#1D1D1B" stroke-width="0.238517" stroke-miterlimit="10" stroke-linecap="square"/>
              <path d="M8.74361 15.5711H5.15917L4.54102 8.66187H8.42091L8.74361 15.5711Z" stroke="#1D1D1B" stroke-width="1.19259" stroke-linejoin="bevel"/>
              <path d="M16.2806 15.5711H12.6523L13.0468 8.66187H16.8987L16.2806 15.5711Z" stroke="#1D1D1B" stroke-width="1.19259" stroke-linejoin="bevel"/>
              <path d="M12.5603 17.6926H8.8606L8.39844 8.66187H13.0225L12.5603 17.6926Z" stroke="#1D1D1B" stroke-width="1.19259" stroke-miterlimit="10"/>
              </svg>

            <a href="https://academy.uni.rest/team">Команда</a>
          </li>
          <li>
            <svg width="21" height="20" viewBox="0 0 21 20" xmlns="http://www.w3.org/2000/svg">
              <path d="M17.6374 3.63672H13.959V13.6682H17.6374V3.63672Z" stroke="#1D1D1B" stroke-width="1.19399" stroke-linejoin="bevel"/>
              <path d="M12.0749 6.38708H8.39648V13.6681H12.0749V6.38708Z" stroke="#1D1D1B" stroke-width="1.19399" stroke-linejoin="bevel"/>
              <path d="M6.51244 9.4375H2.83398V13.6681H6.51244V9.4375Z" stroke="#1D1D1B" stroke-width="1.19399" stroke-linejoin="bevel"/>
              <path d="M2.29102 15.3019H18.2714" stroke="#1D1D1B" stroke-width="0.238799" stroke-linejoin="bevel"/>
              <path d="M2.29102 16.4434H18.2714" stroke="#1D1D1B" stroke-width="0.238799" stroke-linejoin="bevel"/>
              </svg>

            <a href="https://academy.uni.rest/_wt/report_by_subdivision"
              >Отчеты ARL</a
            >
          </li>
          <li>
            <svg width="20" height="20" viewBox="0 0 20 20"  xmlns="http://www.w3.org/2000/svg">
              <path d="M15.5129 10.5886C13.955 12.1465 12.0093 13.0411 10.0745 13.2498L6.81445 9.98971C7.02316 8.05496 7.9177 6.10923 9.47563 4.5513C11.8598 2.16714 15.1519 1.33612 17.9243 2.13991C18.7281 4.91189 17.8971 8.20445 15.5129 10.5886Z" stroke="#1D1D1B" stroke-width="1.19399" stroke-miterlimit="10"/>
              <path d="M10.0903 13.2676L6.79492 9.97217L5.37754 11.3896L8.67294 14.685L10.0903 13.2676Z" stroke="#1D1D1B" stroke-width="1.19399" stroke-linejoin="round"/>
              <path d="M13.6219 8.20496C14.6751 8.20496 15.5289 7.35115 15.5289 6.29792C15.5289 5.24469 14.6751 4.39087 13.6219 4.39087C12.5687 4.39087 11.7148 5.24469 11.7148 6.29792C11.7148 7.35115 12.5687 8.20496 13.6219 8.20496Z" stroke="#1D1D1B" stroke-width="0.238799" stroke-miterlimit="10" stroke-linecap="square"/>
              <path d="M7.98215 6.44458H5.45088L3.56055 8.79197L6.83591 9.9788" stroke="#1D1D1B" stroke-width="1.19399" stroke-linejoin="bevel"/>
              <path d="M13.6202 12.0802V14.6115L11.2728 16.5018L10.0859 13.2264" stroke="#1D1D1B" stroke-width="1.19399" stroke-linejoin="bevel"/>
              <path d="M5.38073 14.6812L2.14453 17.9178" stroke="#1D1D1B" stroke-width="0.238799" stroke-miterlimit="10" stroke-linecap="square"/>
              <path d="M3.39996 12.6991L1.63477 14.4643" stroke="#1D1D1B" stroke-width="0.238799" stroke-miterlimit="10" stroke-linecap="square"/>
              <path d="M7.36481 16.6636L5.59961 18.4288" stroke="#1D1D1B" stroke-width="0.238799" stroke-miterlimit="10" stroke-linecap="square"/>
            </svg>

            <a href="https://academydev.corp.uni.rest/_wt/people_cycle "
              >Цели и развитие</a
            >
          </li>
          <li>
            <svg width="21" height="20" viewBox="0 0 21 20"  xmlns="http://www.w3.org/2000/svg">
              <path d="M15.2654 7.23243C16.0295 8.04817 16.2072 9.29709 15.6188 10.3153C15.0314 11.3336 13.8612 11.8045 12.7728 11.5504C12.4485 12.6202 11.4551 13.3982 10.2793 13.3982C9.10341 13.3982 8.11049 12.6202 7.78572 11.5504C6.6968 11.8045 5.52717 11.3336 4.93973 10.3153C4.35133 9.29709 4.52899 8.04817 5.29314 7.23243C4.52899 6.4167 4.35133 5.16778 4.93973 4.14954C5.52717 3.13131 6.69728 2.66039 7.78572 2.91447C8.11001 1.84465 9.10341 1.06665 10.2793 1.06665C11.4551 1.06665 12.448 1.84465 12.7728 2.91447C13.8617 2.66039 15.0314 3.13131 15.6188 4.14954C16.2072 5.16778 16.0295 6.4167 15.2654 7.23243Z" stroke="#1D1D1B" stroke-width="1.19399" stroke-linejoin="round"/>
              <path d="M7.07227 11.6263V18.2635L10.4164 16.7605L13.4511 18.2635V11.6263" stroke="#1D1D1B" stroke-width="1.19399" stroke-miterlimit="10"/>
              <path d="M6.93164 7.20866C6.93164 9.05505 8.42843 10.5518 10.2748 10.5518C12.1212 10.5518 13.618 9.05505 13.618 7.20866C13.618 5.36227 12.1212 3.86548 10.2748 3.86548" stroke="#1D1D1B" stroke-width="0.238799" stroke-miterlimit="10" stroke-linecap="square"/>
              </svg>

            <a href="#">Признания</a>
          </li>
          <li>
            <svg width="20" height="21" viewBox="0 0 20 21"  xmlns="http://www.w3.org/2000/svg">
              <path d="M9.98899 17.6318C13.8252 17.6318 16.935 14.522 16.935 10.6858C16.935 6.84959 13.8252 3.73975 9.98899 3.73975C6.15281 3.73975 3.04297 6.84959 3.04297 10.6858C3.04297 14.522 6.15281 17.6318 9.98899 17.6318Z" stroke="#1D1D1B" stroke-width="1.22386" stroke-linejoin="bevel"/>
              <path d="M9.98934 13.5208V11.7826C11.2055 11.7826 12.1916 10.7965 12.1916 9.58041C12.1916 8.36428 11.2055 7.37817 9.98934 7.37817C8.77322 7.37817 7.78711 8.36428 7.78711 9.58041" stroke="#1D1D1B" stroke-width="1.22164" stroke-linejoin="bevel"/>
              <path d="M9.98936 15C10.0946 15 10.1799 14.9147 10.1799 14.8094C10.1799 14.7042 10.0946 14.6189 9.98936 14.6189C9.88413 14.6189 9.79883 14.7042 9.79883 14.8094C9.79883 14.9147 9.88413 15 9.98936 15Z"  stroke="#1D1D1B" stroke-width="0.384165"/>

              </svg>

            <a href="#">Помощь</a>
          </li>
          <li className="icon_setting">
            <svg width="21" height="21" viewBox="0 0 21 21"  xmlns="http://www.w3.org/2000/svg">
              <path d="M18.3733 10.6545C18.3733 11.3255 18.2916 11.9774 18.1378 12.6007C17.1339 12.2874 16.0111 12.6981 15.4633 13.6471C14.9155 14.5961 15.1204 15.7724 15.8926 16.4864C14.9575 17.3862 13.806 18.0635 12.5246 18.4331C12.2935 17.4063 11.3765 16.6397 10.2804 16.6397C9.1843 16.6397 8.26684 17.4063 8.03616 18.4331C6.75476 18.0635 5.60327 17.3862 4.66814 16.4864C5.44089 15.7724 5.64578 14.5961 5.0975 13.6471C4.54922 12.6981 3.42686 12.2874 2.42295 12.6007C2.26917 11.9774 2.1875 11.3255 2.1875 10.6545C2.1875 9.98347 2.26917 9.33251 2.42247 8.70876C3.42638 9.02207 4.54922 8.61181 5.0975 7.66235C5.6453 6.71336 5.44041 5.53656 4.66814 4.82302C5.60327 3.92323 6.75476 3.246 8.03616 2.87634C8.26731 3.90318 9.1843 4.66972 10.2804 4.66972C11.3765 4.66972 12.2939 3.90318 12.5246 2.87634C13.806 3.246 14.9575 3.92323 15.8926 4.82302C15.1199 5.53656 14.915 6.71336 15.4633 7.66235C16.0111 8.61181 17.1339 9.02207 18.1383 8.70876C18.2916 9.33203 18.3733 9.98347 18.3733 10.6545Z" stroke="#1D1D1B" stroke-width="1.19399" stroke-miterlimit="2" stroke-linecap="square"/>
              <path d="M10.2777 12.8228C11.4752 12.8228 12.446 11.852 12.446 10.6545C12.446 9.45698 11.4752 8.48621 10.2777 8.48621C9.08015 8.48621 8.10938 9.45698 8.10938 10.6545C8.10938 11.852 9.08015 12.8228 10.2777 12.8228Z" stroke="#1D1D1B" stroke-width="1.19399" stroke-miterlimit="2" stroke-linecap="square"/>
              <path d="M10.2798 14.649C12.4859 14.649 14.2744 12.8606 14.2744 10.6544C14.2744 8.44825 12.4859 6.65979 10.2798 6.65979C8.07361 6.65979 6.28516 8.44825 6.28516 10.6544C6.28516 12.8606 8.07361 14.649 10.2798 14.649Z" stroke="#1D1D1B" stroke-width="0.238799" stroke-miterlimit="10" stroke-linecap="square"/>
              </svg>

            <a href="#">Настройки</a>
          </li>
          <li className="icon_exit">
            <svg width="16" height="17" viewBox="0 0 16 17"  xmlns="http://www.w3.org/2000/svg">
              <path d="M4.20898 10.5004V13.7546C4.20898 14.4485 4.7719 15.0114 5.46577 15.0114H10.9491C11.643 15.0114 12.2059 14.4485 12.2059 13.7546V4.19183C12.2059 3.49757 11.643 2.93506 10.9491 2.93506H5.46577C4.7719 2.93506 4.20898 3.49757 4.20898 4.19183V7.44561" stroke="#ED1C29" stroke-width="1.19399" stroke-miterlimit="2" stroke-linecap="square"/>
              <path d="M5.52344 10.5003V13.3793C5.52344 13.5547 5.66562 13.6969 5.84102 13.6969H10.5741C10.7495 13.6969 10.8917 13.5547 10.8917 13.3793V4.56647C10.8917 4.39107 10.7495 4.2489 10.5741 4.2489H5.84102C5.66562 4.2489 5.52344 4.39107 5.52344 4.56647V7.4455" stroke="#ED1C29" stroke-width="0.238799" stroke-miterlimit="10" stroke-linecap="square"/>
              <path d="M2.08221 8.96567L2.07972 8.97318L2.08221 8.98068L2.90632 11.4706H1.88104L1.05445 8.97318L1.88104 6.47578H2.90632L2.08221 8.96567Z" fill="#ED1C29" stroke="#ED1C29" stroke-width="0.0477597"/>
              <path d="M1.27148 8.97327H7.14737" stroke="#ED1C29" stroke-width="1.19399" stroke-miterlimit="10"/>
              </svg>

            <a href="#">Выход</a>
          </li>
        </ul>
      </nav>
    </div>
    )
}

export default SidebarMenuComponent